_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СценарииПланированияПроектовСтроительства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзMSProject</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьКритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовКритичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКодаСДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДлительностиЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	СценарийПланирования = Объект.Ссылка;
	
	УстановитьПараметрыСписка();
	УстановитьПараметрыРесурсовМатериалов();
	
	ЭтоНовыйВариант = Объект.НовыйВариант; 
	//ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка);
	ОбъектКопированияНовыйВариант = Параметры.ЗначениеКопирования;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//Инструкция = СтандартныеПодсистемыСервер.ИнструкцияУсловногоОформления();
	//Инструкция.Поля = "Список_СтараяВерсия";
	//Инструкция.Отборы.Вставить("Список_СтараяВерсия.ИндексКартинки", 0);
	//Инструкция.Оформление.Вставить("Шрифт", Новый Шрифт(,,Истина));  
	//СтандартныеПодсистемыСервер.ДобавитьЭлементУсловногоОформления(ЭтотОбъект, Инструкция);
	
	
	//УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список_СтараяВерсия.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список_СтараяВерсия.ИндексКартинки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка()
	
	Список_СтараяВерсия.Параметры.УстановитьЗначениеПараметра("СценарийПланирования",СценарийПланирования);
	
	ЭлементОтбора = Список_СтараяВерсия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СценарийПланирования; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыРесурсовМатериалов()
	
	СписокМатериалы_СтараяВерсия.Параметры.УстановитьЗначениеПараметра("СценарийПланирования",СценарийПланирования);
	СписокМатериалы_СтараяВерсия.Параметры.УстановитьЗначениеПараметра("ТекущаяРабота",Элементы.Список_СтараяВерсия.ТекущаяСтрока);
	
	СписокРесурсы_СтараяВерсия.Параметры.УстановитьЗначениеПараметра("СценарийПланирования",СценарийПланирования);
	СписокРесурсы_СтараяВерсия.Параметры.УстановитьЗначениеПараметра("ТекущаяРабота",Элементы.Список_СтараяВерсия.ТекущаяСтрока);
	
КонецПроцедуры    

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВидСценарияУникален = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ВидСценарияУникален(ТекущийОбъект);
	
	Если Не ВидСценарияУникален Тогда
		ТекстСообщения = НСтр("ru='Для обекта строительства ""<Владелец>"" уже существует сценарий планирования с видом ""<ВидСценария>""'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "<Владелец>", Строка(ТекущийОбъект.Владелец));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "<ВидСценария>", Строка(ТекущийОбъект.ВидСценария));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВидСценария", "Объект"); 
		Отказ = Истина;
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидСценарияПроверен", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоНовыйВариант Тогда
		ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаЭлементаДинамическая",Новый Структура("Ключ,ЗначениеКопирования",Объект.Ссылка,ОбъектКопированияНовыйВариант));
		Отказ = Истина;
	КонецЕсли;
	
	Элементы.Список_СтараяВерсияКомандаПоказатьРесурсыМатериалы_СтараяВерсия.Пометка = Ложь;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаСтраницаПланПроекта_СтараяВерсия.Видимость = ЗначениеЗаполнено(СценарийПланирования);
	Элементы.ГруппаРесурсыМатериалы_СтараяВерсия.Видимость    =  Элементы.Список_СтараяВерсияКомандаПоказатьРесурсыМатериалы_СтараяВерсия.Пометка;
	
КонецПроцедуры  

#КонецОбласти 

&НаКлиенте
Процедура Список_СтараяВерсияПриАктивизацииСтроки(Элемент)
	
	УстановитьПараметрыРесурсовМатериалов();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьРесурсыМатериалы_СтараяВерсия(Команда)
	Элементы.Список_СтараяВерсияКомандаПоказатьРесурсыМатериалы_СтараяВерсия.Пометка = НЕ  Элементы.Список_СтараяВерсияКомандаПоказатьРесурсыМатериалы_СтараяВерсия.Пометка;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	
	Объект.НачалоСтроительства = Объект.Владелец.НачалоСтроительства;
	Объект.ОкончаниеСтроительства = Объект.Владелец.ОкончаниеСтроительства;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры
